car_catalog = []


car_catalog.append({
    "Модель": "Kia Rio",
    "Класс": "эконом",
    "Цена": "1 200 000 руб",
    "Объем двигателя": "1.6 л",
    "Разгон": "10.2 сек",
    "Привод": "передний",
    "Год выпуска": 2019,
    "Страна": "Южная Корея"
})

car_catalog.append({
    "Модель": "Hyundai Solaris",
    "Класс": "эконом",
    "Цена": "1 300 000 руб",
    "Объем двигателя": "1.6 л",
    "Разгон": "10.0 сек",
    "Привод": "передний",
    "Год выпуска": 2020,
    "Страна": "Южная Корея"
})

car_catalog.append({
    "Модель": "Lada Vesta",
    "Класс": "эконом",
    "Цена": "1 100 000 руб",
    "Объем двигателя": "1.8 л",
    "Разгон": "11.0 сек",
    "Привод": "передний",
    "Год выпуска": 2019,
    "Страна": "Россия"
})

car_catalog.append({
    "Модель": "BMW 3",
    "Класс": "премиум",
    "Цена": "4 500 000 руб",
    "Объем двигателя": "2.0 л",
    "Разгон": "6.5 сек",
    "Привод": "задний",
    "Год выпуска": 2021,
    "Страна": "Германия"
})

car_catalog.append({
    "Модель": "Mercedes E",
    "Класс": "премиум",
    "Цена": "5 000 000 руб",
    "Объем двигателя": "2.0 л",
    "Разгон": "6.3 сек",
    "Привод": "задний",
    "Год выпуска": 2018,
    "Страна": "Германия"
})

car_catalog.append({
    "Модель": "Toyota Corolla",
    "Класс": "бизнес",
    "Цена": "2 000 000 руб",
    "Объем двигателя": "1.8 л",
    "Разгон": "9.8 сек",
    "Привод": "передний",
    "Год выпуска": 2019,
    "Страна": "Япония"
})

car_catalog.append({
    "Модель": "Audi A4",
    "Класс": "премиум",
    "Цена": "4 700 000 руб",
    "Объем двигателя": "2.0 л",
    "Разгон": "6.0 сек",
    "Привод": "передний",
    "Год выпуска": 2020,
    "Страна": "Германия"
})

car_catalog.append({
    "Модель": "Skoda Octavia",
    "Класс": "бизнес",
    "Цена": "2 300 000 руб",
    "Объем двигателя": "1.4 л",
    "Разгон": "8.5 сек",
    "Привод": "передний",
    "Год выпуска": 2021,
    "Страна": "Чехия"
})

car_catalog.append({
    "Модель": "Renault Duster",
    "Класс": "кроссовер",
    "Цена": "1 800 000 руб",
    "Объем двигателя": "2.0 л",
    "Разгон": "10.5 сек",
    "Привод": "полный",
    "Год выпуска": 2022,
    "Страна": "Франция"
})

car_catalog.append({
    "Модель": "Mazda 3",
    "Класс": "бизнес",
    "Цена": "2 400 000 руб",
    "Объем двигателя": "2.0 л",
    "Разгон": "8.2 сек",
    "Привод": "передний",
    "Год выпуска": 2023,
    "Страна": "Япония"
})


for car in car_catalog:
    car["Рассрочка"] = True


def filter_cars_by_param(catalog, kriteriy, param):
    result = []
    for car in catalog:
        if car.get(param) == kriteriy:
            result.append((car["Модель"], car["Класс"]))
    return result


petya_result = filter_cars_by_param(car_catalog, 2019, "Год выпуска")

print("Подходящие машины для Пети (год выпуска = 2019):")
for model, car_class in petya_result:
    print(f"Модель: {model}, Класс: {car_class}")
