car_info = {
    ("Toyota Camry", "бизнес"): {
        "Цена": "3 000 000 руб",
        "Объем двигателя": "2.5 л",
        "Время разгона до 100 км/ч": "8.5 сек",
        "Привод": "передний",
        "Дата выпуска": "2023",
        "Страна производитель": "Япония"
    },
    ("BMW X5", "премиум"): {
        "Цена": "9 500 000 руб",
        "Объем двигателя": "3.0 л",
        "Время разгона до 100 км/ч": "5.2 сек",
        "Привод": "полный",
        "Дата выпуска": "2024",
        "Страна производитель": "Германия"
    }
}
